package com.fsit.sohojnamaj.model.dua

import com.fsit.sohojnamaj.R


data class AlifBaa(
    val alphabet: String,
    val bangla: String,
    val uccaron: String,
    val source: String,
    val audioId: Int,
)

val AlifBaaList=

    arrayListOf(
        AlifBaa("ث", "ছা", "ছ", "জিহ্বার আগা সামনের উপরের দুই দাঁতের আগার সঙ্গে লাগিয়ে", R.raw.h4chaa),
        AlifBaa("ت", "তা", "ত (শেষে গোল তা হলে হ)", "জিহ্বার আগা সামনের উপরের দুই দাঁতের গােড়ার সঙ্গে লাগিয়ে", R.raw.h3taa),
        AlifBaa("ب", "বা", "ব", "দুই ঠোটের মধ্যস্থল হতে", R.raw.h2baa),
        AlifBaa("ا", "আলিফ", "আ+ই+উ", "মুখের ভিতর খালি জায়গা হতে বাতাসের সাথে উচ্চারিত হবে। (যখন মাদের জন্য উচ্চারিত হবে)", R.raw.h1alif),

        AlifBaa("خ", "খ-", "খ", "কণ্ঠনালীর অগ্রভাগ হইতে উচ্চারিত হয়", R.raw.h7khau),
        AlifBaa("ح", "হাঁ", "হ", "কণ্ঠনালীর মধ্যখান হইতে উচ্চারিত হয়", R.raw.h6haa),
        AlifBaa("ج", "জীম", "জ", "জিহ্বার মধ্যখান তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h5jeem),
        AlifBaa("د", "দাল", "দ", "জিহ্বার আগা সামনের উপরের দুই দাঁতের গােড়ার সঙ্গে লাগিয়ে", R.raw.h8daal),


        AlifBaa("س", "ছীন", "ছ", "জিহ্বার আগা সামনের নিচের দুই দাঁতের পেট ও আগার সঙ্গে লাগিয়ে", R.raw.h12seen),
        AlifBaa("ز", "ঝা", "ঝ", "জিহ্বার আগা সামনের নিচের দুই দাঁতের পেট ও আগার সঙ্গে লাগিয়ে", R.raw.h11jhaa),
        AlifBaa("ر", "র-", "র", "জিহ্বার আগার পিঠ, তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h10rau),
        AlifBaa("ذ", "যাল", "য", "জিহ্বার আগা সামনের উপরের দুই দাঁতের আগার সঙ্গে লাগিয়ে", R.raw.h9jaal),

        AlifBaa("ط", "ত্ব-", "ত্ব", "জিহ্বার আগা সামনের উপরের দুই দাঁতের গােড়ার সঙ্গে লাগিয়ে", R.raw.h16tau),
        AlifBaa("ض", "দ-দ", "দ", "জিহ্বার গােড়ার কিনারা উপরের মাড়ীর দাঁতের গােড়ার সঙ্গে লাগিয়ে", R.raw.h15daud),
        AlifBaa("ص", "ছ-দ", "ছ", "জিহ্বার আগা সামনের নিচের দুই দাঁতের পেট ও আগার সঙ্গে লাগিয়ে", R.raw.h14saud),
        AlifBaa("ش", "শীন", "শ", "জিহ্বার মধ্যখান তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h13sheen),

        AlifBaa("ف", "ফা", "ফ", "নিচের ঠোটের পেট, সামনের উপরের দুই দাঁতের আগার সঙ্গে লাগিয়ে", R.raw.h20faa),
        AlifBaa("غ", "গইন", "গ", "কণ্ঠনালীর অগ্রভাগ হতে উচ্চারিত হয়", R.raw.h19gaien),
        AlifBaa("ع", "আইন", "‘আ+‘ই+‘ঈ+‘উ+‘ঊ", "কণ্ঠনালীর মধ্যখান হতে উচ্চারিত হয়, ع এর সাথে যের হলে, ع এর সাথে যের এবং তারপরে ىْ হলে، ع এর উপর পেশ হলে, ع এর উপর পেশ এবং তারপরে وْ হলে", R.raw.h18aien),
        AlifBaa("ظ", "জ-", "জ", "জিহ্বার আগা সামনের উপরের দুই দাঁতের আগার সঙ্গে লাগিয়ে হালকাভাবে উচ্চারিত হয়", R.raw.h17jau),


        AlifBaa("م", "মীম", "ম", "দুই ঠোটের মাঝখানের শুকনা জায়গা হতে", R.raw.h24meem),
        AlifBaa("ل", "লাম", "ল", "জিহ্বার আগার কিনারা উপরের সামনে এক পাশের দাঁতের মাড়ীর সঙ্গে লাগিয়ে", R.raw.h23laam),
        AlifBaa("ك", "কাফ", "ক", "জিহ্বার গােড়া হতে একটু আগে বাড়িয়ে তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h22kaaf),
        AlifBaa("ق", "ক্ব-ফ", "ক্ব", "জিহ্বার গােড়া, তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h21kauf),

        AlifBaa("ء", "হামযাহ", "আ/ই/উ", "কণ্ঠনালীর গােড়া হতে উচ্চারিত হয়", R.raw.h28hamjah),
        AlifBaa("ه", "হা", "হ", "কণ্ঠনালীর গােড়া হতে উচ্চারিত হয়", R.raw.h27haa),
        AlifBaa("و", "ওয়াও", "ওয়া", "দুই ঠোটের মাঝখানের শুকনা জায়গা হতে", R.raw.h26ouaw),
        AlifBaa("ن", "নূন", "ন", "জিহ্বার আগা তার বরাবর উপরের তালুর সঙ্গে লাগিয়ে", R.raw.h25noon),

        AlifBaa("ي", "ইয়া-", "ইয়া", "মুখের ভিতর খালি জায়গা হতে বাতাসের সাথে উচ্চারিত হবে", R.raw.h29eiya)
    )
