package com.fsit.sohojnamaj.model.dua

import androidx.room.Entity
import androidx.room.PrimaryKey

@Entity(tableName = "type_one")
data class TypeOneItem(
    @PrimaryKey(autoGenerate = false)
    val id:Int,
    val sub_category:Int,
    val title:String?,
    val data:String?,
    val other:String?

)
val sampleTypeOne= listOf(
    TypeOneItem(0,0,"","ইসলামের পরিভাষায়, গোসল হল সমস্ত দেহ ধৌত করার মাধ্যমে পূর্ণ পবিত্রতা অর্জনের একটি পন্থা। কথিপয় ধর্মীয় উপাসনা এবং আচার-আনুষ্ঠান পালনের পূর্বশর্ত হচ্ছে গোসল। সকল প্রাপ্তবয়স্ক মোসলমান নর-নারীর যৌনসঙ্গম , যৌনস্থলন (যেমন : বির্যপাত), রজস্রাবঃ সমাপ্তির পর, সন্তান প্রসবের পর এবং স্বাভাবিক কারণে মৃত্যুর পর গোসল করা ফরজ (বাধ্যতামূলক) হয়। তাছাড়া, শুক্রবার জুম্মার নামাজের পূর্বে, ঈদের নামাজের পূর্বে, এহরামের পূর্বে, হজ্জের জন্য প্রস্তুত হওয়ার সময়,অজ্ঞান হওয়ার পর সচেতন হলে অথবা আনুষ্ঠানিকভাবে কেঊ ইসলাম ধর্ম গ্রহণ করার পূর্বে গোসল করা মুস্তাহাব (উৎসাহিত করা হয়)। শিয়া মতে, তওবার নামাযের পূর্বে গোসল করতে হয়।",""
    ),
    TypeOneItem(0,0,"গোসল চার-প্রকার যেমনঃ","১.ফরজ গোসল।\\n\n" +
            "২.ওয়াজিব গোসল।\\n\n" +
            "৩.সুন্নাত গোসল।\\n\n" +
            "৪.মুস্তাহাব গোসল। ","")
)
