package com.fsit.sohojnamaj

import android.content.Context
import android.content.res.AssetManager
import android.media.AudioManager
import android.os.Build
import android.os.Bundle
import android.util.Log
import androidx.activity.ComponentActivity
import androidx.activity.compose.setContent
import androidx.annotation.RequiresApi
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.material3.MaterialTheme
import androidx.compose.material3.Surface
import androidx.compose.runtime.Composable
import androidx.compose.ui.Modifier
import androidx.core.splashscreen.SplashScreen.Companion.installSplashScreen
import com.fsit.sohojnamaj.database.dao.NameDao
import com.fsit.sohojnamaj.model.Name
import com.fsit.sohojnamaj.ui.navigation.AppNavHost
import com.fsit.sohojnamaj.ui.navigation.AppState
import com.fsit.sohojnamaj.ui.navigation.rememberAppState
import com.fsit.sohojnamaj.ui.theme.NamajShikkhaTheme
import com.fsit.sohojnamaj.util.praytimes.Praytime
import dagger.hilt.android.AndroidEntryPoint
import kotlinx.coroutines.CoroutineScope
import kotlinx.coroutines.Dispatchers
import kotlinx.coroutines.launch
import se.warting.inappupdate.compose.RequireLatestVersion
import java.io.*
import java.util.*
import javax.inject.Inject


@AndroidEntryPoint
class MainActivity : ComponentActivity() {
    @Inject
    lateinit var suraDao: NameDao
    override fun onCreate(savedInstanceState: Bundle?) {
        installSplashScreen()
        super.onCreate(savedInstanceState)
        copyAssets(this)
        volumeControlStream = AudioManager.STREAM_ALARM
        Praytime.configureForegroundService(this)
        Log.i("123321", "onCreate: ${R.drawable.a_01_allah} ")


        //  PrayTime.schedule(this)


        val list:ArrayList<Name> = ArrayList()
        list.add(
           Name(
                "১ ",
                "আল্লাহ",
                "আল্লাহ",
                "প্রত্যহ ১০০০ বার এই নামের যিকির করলে ঈমান দৃঢ় ও মযবুত হয়।",
                R.drawable.a_01_allah,
                R.raw.a_01_allah
            )
        )
        list.add(
           Name(
                "২ ",
                "আর রাহমান",
                "পরম দয়ালু",
                "প্রত্যেক নামাযের পর ১০০ বার পড়লে, ইনশাআল্লাহ্‌ তার অন্তর থেকে সব ধরনের কঠোরতা ও অলসতা দূর হয়ে যাবে।",
                R.drawable.a_02_ar_rahman,
                R.raw.a_02_ar_rahman
            )
        )
        list.add(
           Name(
                "৩ ",
                "আর-রহী'ম",
                "অতিশয়-মেহেরবান",
                "প্রত্যেক নামাযের পর ১০০ বার করে পাঠ করলে, ইনশাআল্লাহ্‌ পৃথিবীর সকল বিপদ আপদ থেকে নিরাপদ থাকবে।",
                R.drawable.a_03_ar_rahim,
                R.raw.a_03_ar_rahim
            )
        )
        list.add(
           Name(
                "৪ ",
                "আল-মালিক",
                "সর্বকর্তৃত্বময়",
                "ফযরের নামাজের পর অধিকহারে পাঠ করবে, আল্লাহ্‌ তায়ালা তাকে ধনবান করে দিবেন।",
                R.drawable.a_04_al_malik,
                R.raw.a_04_al_malik
            )
        )
        list.add(
           Name(
                "৫ ",
                "আল-কুদ্দুস",
                "নিষ্কলুষ, অতি পবিত্র",
                "প্রত্যহ শেষ রাতে (উয়া কুদ্দূসু) নামুটি ১০০০ বার পড়লে রোগ ব্যধি থেকে মুক্ত থাকা যায়।",
                R.drawable.a_05_al_kuddsh,
                R.raw.a_05_al_kuddsh
            )
        )
        list.add(
           Name(
                "৬ ",
                "আস-সালাম",
                "নিরাপত্তা-দানকারী, শান্তি-দানকারী",
                "এই নামটি ১১৫ বার কোন রুগির উপর পরে ফু দিবে, তাহলে আল্লাহ তায়ালা তাকে সুস্থতা ও আরোগ্য দান করবেন।",
                R.drawable.a_06_as_salam,
                R.raw.a_06_as_salam
            )
        )
        list.add(
           Name(
                "৭ ",
                "আল-মু'মিন",
                "নিরাপত্তা ও ঈমান দানকারী",
                "যে ব্যক্তি কোন ভয়-ভীতির সময় ৬৩০ বার এ নামটি পাঠ করবে, ইনশাআল্লাহ্‌ সে সব ধরনের ভয়-ভীতি ও অনিষ্ঠ থেকে নিরাপদ থাকবে। যে ব্যক্তি এ নামটি পাঠ করবে বা লিখে নিজের সাথে রাখবে, আল্লাহ্‌ তায়ালা তাকে শয়তানের অনিষ্ঠ থেকে রক্ষা করবেন।",
                R.drawable.a_07_al_mu_min,
                R.raw.a_07_al_mu_min
            )
        )
        list.add(
           Name(
                "৮ ",
                "আল-মুহাইমিন",
                "পরিপূর্ন রক্ষণাবেক্ষণকারী",
                "যে ব্যক্তি গোসল করে ১১৫ বার এ নামটি পরবে, গোপন বিষয়াদি উপর অবগত হবে। সর্বদা পরলে সব বিপদ থেকে মুক্তি পাবে।",
                R.drawable.a_08_al_muhaymin,
                R.raw.a_08_al_muhaymin
            )
        )
        list.add(
           Name(
                "৯ ",
                "আল-আ'জীজ",
                "পরাক্রমশালী, অপরাজেয়",
                "৪০ দিন পর্যন্ত যে ব্যক্তি এ নামটি ৪০ বার পাঠ করবে, আল্লাহ তাকে সম্মানী ও অমুখাপেক্ষী বানিয়ে দিবেন।",
                R.drawable.a_09_al_aziz,
                R.raw.a_09_al_aziz
            )
        )
        list.add(
           Name(
                "১০ ",
                "আল-জাব্বার",
                "দুর্নিবার",
                "যে ব্যক্তি প্রতি দিন সকাল-বিকাল ২২৬ বার পড়লে যাবতীয় জুলুম থেকে মুক্তিপাবে।",
                R.drawable.a_10_al_jabbar,
                R.raw.a_10_al_jabbar
            )
        )
        list.add(
           Name(
                "১১ ",
                "আল-মুতাকাব্বিইর",
                "নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী",
                "এই নাম সর্বদা পড়লে মান সম্মান বৃদ্ধি পায় ও উন্নতি লাভ হয়।",
                R.drawable.a_11_al_mutakabbir,
                R.raw.a_11_al_mutakabbir
            )
        )
        list.add(
           Name(
                "১২ ",
                "আল-খালিক্ব",
                "সৃষ্টিকর্তা",
                "যে ব্যক্তি সাত দিন পর্যন্ত ধারাবাহিক ১০০ বার এ নামটি পাঠ করবে, ইনশাআল্লাহ্‌ সকল বিপদআপদ থেকে নিরাপদ থাকবে।",
                R.drawable.a_12_al_khalik,
                R.raw.a_12_al_khalik
            )
        )
        list.add(
           Name(
                "১৩ ",
                "আল-বারী",
                "সঠিকভাবে সৃষ্টিকারী",
                "বন্ধ্যা নারী যদি সাতদিন রোযা রাখে এবং পানি দ্বারা ইফতার করার পর (ইয়া বারী-উল মুছউইর) ২১ বার পাঠ করবে, তাহলে ইনশাআল্লাহ্‌ তার পুত্র সন্তান লাভ হবে।",
                R.drawable.a_13_al_bari,
                R.raw.a_13_al_bari
            )
        )
        list.add(
           Name(
                "১৪ ",
                "আল-মুছউইর",
                "আকৃতি-দানকারী",
                "বন্ধ্যা নারী যদি সাতদিন রোযা রাখে এবং পানি দ্বারা ইফতার করার পর (ইয়া বারী-উল মুছউইর) ২১ বার পাঠ করবে, তাহলে ইনশাআল্লাহ্‌ তার পুত্র সন্তান লাভ হবে।",
                R.drawable.a_14_al_musawir,
                R.raw.a_14_al_musawir
            )
        )
        list.add(
           Name(
                "১৫ ",
                "আল-গফ্ফার",
                "পরম ক্ষমাশীল",
                "জুম্মার নামাযের পর ১০০ বার পড়লে গুনাহ মাফ হয় ও অভাব দূর হয়।",
                R.drawable.a_15_al_goffar,
                R.raw.a_15_al_goffar
            )
        )
        list.add(
           Name(
                "১৬ ",
                "আল-ক্বাহার",
                "কঠোর",
                "ক্রমাগত আল্লাহ্‌র এই নাম পাঠ করলে, পার্থিব ভালবাসা থেকে আপনি মুক্তি পাবেন এবং পরিবর্তে আল্লাহ্‌র ভালবাসা আপানার হৃদয়ে সহজাত হয়ে যাবে। ইনশাআল্লাহ্‌",
                R.drawable.a_16_al_kohhar,
                R.raw.a_16_al_kohhar
            )
        )
        list.add(
           Name(
                "১৭ ",
                "আল-ওয়াহ্হাব",
                "সবকিছু দানকারী",
                "চাশতের নামাযের পর সেজদায় গিয়ে ১০০ বার পড়লে অর্থ ও প্রভাব বৃদ্ধি পায়।",
                R.drawable.a_17_al_wahhav,
                R.raw.a_17_al_wahhav
            )
        )
        list.add(
           Name(
                "১৮ ",
                "আর-রজ্জাক্ব",
                "রিযকদাতা",
                "ফজরের নামাযের পূবে এই নামের যিকির করলে রিযিক বৃদ্ধি পায়।",
                R.drawable.a_18_ar_razzak,
                R.raw.a_18_ar_razzak
            )
        )
        list.add(
           Name(
                "১৯ ",
                "আল ফাত্তাহ",
                "বিজয়দানকারী",
                "ফযরের নামাজের পর দুই হাত বুকের উপর রেখে ৭০ বার এই নাম পাঠ করলে, ইনশাআল্লাহ্‌ তার অন্তর ঈমানের জ্যোতি দ্বারা আলোকিত হবে।",
                R.drawable.a_19_al_fettah,
                R.raw.a_19_al_fettah
            )
        )
        list.add(
           Name(
                "২০ ",
                "আল-আ'লীম",
                "সর্বজ্ঞ",
                "এ নাম সর্বদা পড়লে জ্ঞান বৃদ্ধি পায় গুনাহ মাফ হয় ও মনের কপাট খুলে যায়।",
                R.drawable.a_20_al_alim,
                R.raw.a_20_al_alim
            )
        )
        list.add(
           Name(
                "২১ ",
                "আল-ক্ববিদ্ব",
                "সংকীর্ণকারী",
                "যে ব্যক্তি ৪০ দিন এই নামটি ৪ টুকরা রুটির উপর লিখে খাবে, তিনি ক্ষুদা, পিপাসা ও ব্যথা বেদনা থেকে রক্ষা পাবে।",
                R.drawable.a_21_al_kobid,
                R.raw.a_21_al_kobid
            )
        )
        list.add(
           Name(
                "২২ ",
                "আল-বাসিত",
                "প্রশস্তকারী",
                "প্রতিদিন নামাজের পর মুনাজাত করে ১০ বার আল্লাহ্‌র এই নাম পাঠ করেন, আল্লাহ্‌ তায়ালা তাকে ধনী বনিয়ে দিবেন এবং কখন কার মুখাপেক্ষী হবে না।",
                R.drawable.a_22_al_basit,
                R.raw.a_22_al_basit
            )
        )
        list.add(
           Name(
                "২৩ ",
                "আল-খফিদ্বু",
                "অবনতকারী",
                "প্রত্যহ ৫০০ বার এ নামের ‍পাঠ করলে আল্লাহ্‌ তায়ালা তার প্রয়োজন পূর্ণ করবেন ও সকল সমস্যা দূর করে দিবেন।",
                R.drawable.a_23_al_khafid,
                R.raw.a_23_al_khafid
            )
        )
        list.add(
           Name(
                "২৪ ",
                "আর-রফীই'",
                "উন্নতকারী",
                "১০০ বার পড়লে, আল্লাহ্‌ আপানকে স্বয়ংসম্পূর্ণতা এবং সমগ্র সৃষ্টির স্বাধীনতা প্রদান করা হবে। ইনশাআল্লাহ্",
                R.drawable.a_24_ar_rofiu,
                R.raw.a_24_ar_rofiu
            )
        )
        list.add(
           Name(
                "২৫ ",
                "আল-মুই'জ্ব",
                "সম্মান-দানকারী",
                "প্রতি সোমবার ও শুক্রুবার মাগরিব নামাজ পরে এই নাম্ ৪০ বার পড়লে মর্যাদা বৃদ্ধি পায় ও সকলের নিকট সম্মানের পাত্র হয়।",
                R.drawable.a_25_al_muaiz,
                R.raw.a_25_al_muaiz
            )
        )
        list.add(
           Name(
                "২৬ ",
                "আল-মুদ্বি'ল্লু",
                "(অবিশ্বাসীদের) বেইজ্জতকারী",
                "নামাযের পর সেজদায় গিয়ে ৭৫ বার পড়ে দোয়া করলে শত্রুতা হতে মুক্তি পাওয়া যায়।",
                R.drawable.a_26_al_muzil,
                R.raw.a_26_al_muzil
            )
        )
        list.add(
           Name(
                "২৭ ",
                "আস্-সামিই",
                "সর্বশ্রোতা",
                "শুক্রুবার চাশতের পর ৫০০/১০০/৫০ বার পড়ে দোয়া করলে দোয়া কবুল হয়।",
                R.drawable.a_27_as_sami,
                R.raw.a_27_as_sami
            )
        )
        list.add(
           Name(
                "২৮ ",
                "আল-বাছীর",
                "সর্ববিষয়-দর্শনকারী",
                "জুম্মার নামাযের পর ১০০ বার পড়লে দৃষ্টিতে আলো ও অন্তরে জ্যোতি সৃষ্টি হবে।",
                R.drawable.a_28_al_basir,
                R.raw.a_28_al_basir
            )
        )
        list.add(
           Name(
                "২৯ ",
                "আল-হা'কাম",
                "অটল বিচারক",
                "যে ব্যক্তি অধিক হারে পাঠ করবে, আল্লাহ্‌ তালা তার জন্য জ্ঞান-বিজ্ঞানের দ্বার খুলে দিবেন।",
                R.drawable.a_29_al_hakam,
                R.raw.a_29_al_hakam
            )
        )
        list.add(
           Name(
                "৩০ ",
                "আল-আ'দল",
                "পরিপূর্ণ-ন্যায়বিচারক",
                "শুক্রবার রাতে বিশ টুকরা রুটির উপর লিখে খেলে আল্লাহ্‌ তায়ালা সৃষ্টজীবকে তার অনুগত করে দিবেন।",
                R.drawable.a_30_al_adl,
                R.raw.a_30_al_adl
            )
        )
        list.add(
           Name(
                "৩১ ",
                "আল-লাতীফ",
                "সকল-গোপন-বিষয়ে-অবগত",
                "যে ব্যক্তি ১৩৩ বার পাঠ করবে, ইনশাআল্লাহ্‌ তার খাদ্যে বরকত হবে এবং তার সব কাজ সুন্দরভাবে পূর্ণ হবে।",
                R.drawable.a_31_al_latif,
                R.raw.a_31_al_latif
            )
        )
        list.add(
           Name(
                "৩২ ",
                "আল-খ'বীর",
                "সকল ব্যাপারে জ্ঞাত",
                "৭ দিন পর্যন্ত এ নাম পড়তে থাকলে গোপন তথ্য অবগত হওয়া যায়।",
                R.drawable.a_32_al_khobir,
                R.raw.a_32_al_khobir
            )
        )
        list.add(
           Name(
                "৩৩ ",
                "আল-হা'লীম",
                "অত্যন্ত ধৈর্যশীল",
                "যে ব্যক্তি এই নামটি কাগজে লিখে, পানিতে এটি ডুবিয়ে রেখে এবং সে পানি শস্য ক্ষেত্রে অথবা কোন জিনিসের উপর ছিটিয়ে দিবে, আল্লাহ্‌ তায়ালা তার ফসল নষ্ট করবেনা, বরং সংরক্ষন করবেন।",
                R.drawable.a_33_al_halim,
                R.raw.a_33_al_halim
            )
        )
        list.add(
           Name(
                "৩৪ ",
                "আল-আ'জীম",
                "সর্বোচ্চ-মর্যাদাশীল",
                "নিয়মিত এ নামের যিকির করলে তার মর্যাদা, সম্মান ও শ্রেষ্ঠত্ব লাভ হবে।",
                R.drawable.a_34_al_azim,
                R.raw.a_34_al_azim
            )
        )
        list.add(
           Name(
                "৩৫ ",
                "আল-গফুর",
                "পরম ক্ষমাশীল",
                "অধিকহারে এই নাম পাঠ করলে, সব রোগবালাই, দুঃখ ও দুর্দশা অপসারণ করা হয়, আল্লাহ্‌র দোয়া তার সম্পদ এবং সন্তানাদির উপর পরবে। ইনশাআল্লাহ্‌",
                R.drawable.a_35_al_gofur,
                R.raw.a_35_al_gofur
            )
        )
        list.add(
           Name(
                "৩৬ ",
                "আশ্-শাকুর",
                "গুনগ্রাহী",
                "কোন ব্যক্তি যদি, আর্থিক, মানসিক, শারীরিক ও আধ্যাত্মিক সমস্যার সম্মুখিন হন, ৪১ বার আল্লাহ্‌ এর এই নাম পাঠ করলে, আল্লাহ্‌ শীঘ্রই উদ্ধার প্রদান করবেন। ইনশাআল্লাহ্‌",
                R.drawable.a_36_as_shakoor,
                R.raw.a_36_as_shakoor
            )
        )
        list.add(
           Name(
                "৩৭ ",
                "আল-আ'লিইউ",
                "উচ্চ-মর্যাদাশীল",
                "এ নাম সর্বদা পাঠ করলে ও লিখে সঙ্গে রাখলে ইনশাআল্লাহ্‌ মর্যাদার উচ্চতা, সচ্ছলতা ও উদ্দেশ্যে সফলতা লাভ করবে।",
                R.drawable.a_37_al_ali,
                R.raw.a_37_al_ali
            )
        )
        list.add(
           Name(
                "৩৮ ",
                "আল-কাবিইর",
                "সুমহান",
                "কোন ব্যক্তি কে যদি তার পদ থেকে বরখাস্ত করা হয়, তাহলে ৭ দিন রোযা রেখে এবং প্রতি দিন এই নাম ১০০০ বার পাঠ করলে, আল্লাহ্‌ তার পদ কে সম্মান এবং মর্যাদা দিয়ে পুনরায় ফিরিয়ে দিবেন। ইনশাআল্লাহ্‌",
                R.drawable.a_38_al_kabir,
                R.raw.a_38_al_kabir
            )
        )
        list.add(
           Name(
                "৩৯ ",
                "আল-হা'ফীজ",
                "সংরক্ষণকারী",
                "যে ব্যক্তি অধিক হারে পাঠ করবে এবং লিখে নিজের কাছে রেখে দিবে, ইনশাআল্লাহ্‌ সে সব ধরনের ভয়-ভীতি ও অনিষ্ঠ থেকে নিরাপদে থাকবে।",
                R.drawable.a_39_al_hafiz,
                R.raw.a_39_al_hafiz
            )
        )
        list.add(
           Name(
                "৪০ ",
                "আল-মুক্বীত",
                "সকলের জীবনোপকরণ-দানকারী",
                "৭ বার পড়ে পানিতে ফু দিয়ে সে পানি শিশুকে খাওয়ালে তার কান্না বন্ধ হয়।",
                R.drawable.a_40_al_muqeet,
                R.raw.a_40_al_muqeet
            )
        )
        list.add(
           Name(
                "৪১ ",
                "আল-হাসীব",
                "হিসাব-গ্রহণকারী",
                "কোন ব্যক্তি যদি কোন মানুষ বা কোন জিনিস কে ভয় পান, তাহলে বৃহস্পতিবার থেকে শুরু আট দিনের জন্য রাতে ও সকালে ৭০ বার এবং ৭০ বার (হাসবিয়াল্লাহুল-সাসিবু) পাঠ করলে, আল্লাহ্‌ তার ভয় ও মন্দ জিনিসের বিরুদ্ধে সুরুক্ষা প্রদান করবে। ইনশাআল্লাহ্‌",
                R.drawable.a_41_al_hasib,
                R.raw.a_41_al_hasib
            )
        )
        list.add(
           Name(
                "৪২ ",
                "আল-জালীল",
                "পরম মর্যাদার অধিকারী",
                "এই নামটি মেশক ও জাফরান দিয়ে লিখে নিজের কাছে রাখবে বা ধুয়ে খেলে, তার সম্মান, মহিমা এবং মর্যাদা দিবে। ইনশাআল্লাহ্‌",
                R.drawable.a_42_al_jalil,
                R.raw.a_42_al_jalil
            )
        )
        list.add(
           Name(
                "৪৩ ",
                "আল-কারীম",
                "সুমহান দাতা",
                "ঘুমানোর পূবে এ নামের যিকির করলে আলেম ও সৎ লোকের মর্যাদা লাভ হয়।",
                R.drawable.a_43_al_karim,
                R.raw.a_43_al_karim
            )
        )
        list.add(
           Name(
                "৪৪ ",
                "আর-রক্বীব",
                "তত্ত্বাবধায়ক",
                "এই নাম ৭ বার প্রতিদিন পাঠ করলে এবং নিজের ও তার পরিবারের উপর ফুঁ দিলে, আল্লাহ্‌ ধ্বংস ও বিপর্যয় থেকে আপনাকে এবং আপনার সম্পদ রক্ষা করবেন। ইনশাআল্লাহ্‌",
                R.drawable.a_44_ar_rakib,
                R.raw.a_44_ar_rakib
            )
        )
        list.add(
           Name(
                "৪৫ ",
                "আল-মুজীব",
                "জবাব-দানকারী, কবুলকারী",
                "সর্বদা এই নাম পাঠ করলে আল্লাহ্‌ তায়ালা তার দোয়া কবুল করেন আর নামটি লিখে নিজের কাছে রাখলে সে বিপদ থেকে মুক্তি পাবে।",
                R.drawable.a_45_al_muzib,
                R.raw.a_45_al_muzib
            )
        )
        list.add(
           Name(
                "৪৬ ",
                "আল-ওয়াসি",
                "সর্ব-ব্যাপী, সর্বত্র-বিরাজমান",
                "অধিক পরিমাণে এ নামের যিকির করলে আল্লাহ্‌ তায়ালা তাকে প্রকাশ্য ও ভিতরগত অমুখাপেক্ষিতা ও বরকত দান করবে।",
                R.drawable.a_46_al_washi,
                R.raw.a_46_al_washi
            )
        )
        list.add(
           Name(
                "৪৭ ",
                "আল-হাকীম",
                "পরম-প্রজ্ঞাময়",
                "ক্রমাগত এই নাম পাঠ করলে, আল্লাহ্‌ তায়ালা তার জন্য জ্ঞান বিজ্ঞানের দ্বার খুলে দিবেন।",
                R.drawable.a_47__al_hakim,
                R.raw.a_47__al_hakim
            )
        )
        list.add(
           Name(
                "৪৮ ",
                "আল-ওয়াদুদ",
                "(বান্দাদের প্রতি) সদয়",
                "১০০ বার পড়ে খাদ্যে ফু দিয়ে স্বামী স্ত্রী থেলে তাদের মধ্যে ভালবাসা সৃষ্টি হয়।",
                R.drawable.a_48_al_wadud,
                R.raw.a_48_al_wadud
            )
        )
        list.add(
           Name(
                "৪৯ ",
                "আল-মাজীদ",
                "সকল-মর্যাদার-অধিকারী",
                "প্রত্যহ সকালে ও সন্ধ্যায় ১০০ বার পড়ে শরীরে ফু দিলে সমাজে মর্যাদা বৃদ্ধি পায়।",
                R.drawable.a_49_al_majid,
                R.raw.a_49_al_majid
            )
        )
        list.add(
           Name(
                "৫০ ",
                "আল-বাই'ছ",
                "পুনুরুজ্জীবিতকারী",
                "নিদ্রার পূর্বে বুকের উপর হাত রেখে ১০০০ বার পড়লে জ্ঞান ও হেকমত বৃদ্ধি পায়।",
                R.drawable.a_50_al_ba_ith,
                R.raw.a_50_al_ba_ith
            )
        )
        list.add(
           Name(
                "৫১ ",
                "আশ্-শাহীদ",
                "সর্বজ্ঞ-স্বাক্ষী",
                "এ নামের যিকির বেশী বেশী পড়লে অন্তরের খারাপ বাসনা দূর হয়।",
                R.drawable.a_51_as_sahid,
                R.raw.a_51_as_sahid
            )
        )
        list.add(
           Name(
                "৫২ ",
                "আল-হা'ক্ব",
                "পরম সত্য",
                "যদি, পরিবারের কোন সদস্য নিখোঁজ বা পলাতক বা জিনিসপত্র চুরি হয়ে থাকলে, চারকোণ বিশিষ্ট কাগজের চতুষ্কোণে নামটি লিখে সেহরীর সময় হাতের তালুর উপর রেখে আকাশের দিকে উঠিয়ে দোয়া করবে, ইনশাআল্লাহ্‌ যে কোন ব্যক্তি অথবা জিনিস পাওয়া যাবে এবং ক্ষতি থেকে নিরাপদ থাকবে।",
                R.drawable.a_52_al_hakk,
                R.raw.a_52_al_hakk
            )
        )
        list.add(
           Name(
                "৫৩ ",
                "আল-ওয়াকিল",
                "পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী",
                "যে ব্যক্তি বিপদ আপদের সময় ভয়ে অধিক হারে এই নামটি পাঠ করবে, ইনশাআল্লাহ্‌ বিপদ আপদ থেকে নিরাপদ থাকবে।",
                R.drawable.a_53_al_wakil,
                R.raw.a_53_al_wakil
            )
        )
        list.add(
           Name(
                "৫৪ ",
                "আল-ক্বউইউ",
                "পরম-শক্তির-অধিকারী",
                "জুম্মার পর এ নামের যিকির করলে যুলুম থেকে বাচা যায়।",
                R.drawable.a_54_al_qawiy,
                R.raw.a_54_al_qawiy
            )
        )
        list.add(
           Name(
                "৫৫ ",
                "আল-মাতীন",
                "সুদৃঢ়",
                "যে কোন ভদ্রমহিলা এর বুকের দুধের না থাকলে এক টুকরো কাগজের উপর আল্লাহ্‌ এর এই নাম লিখে পানিতে ডুবিয়ে রেখে তারপর এটি পান করলে তার বুকের মধ্যে দুধ আসবে ইনশাআল্লাহ্‌",
                R.drawable.a_55_al_matin,
                R.raw.a_55_al_matin
            )
        )
        list.add(
           Name(
                "৫৬ ",
                "আল-ওয়ালিইউ",
                "অভিভাবক ও সাহায্যকারী",
                "যে ব্যক্তি অধিক হারে এই নামটি পড়বে সে সৃষ্ট জীবের গোপন তথ্য সম্পর্কে জানবে।",
                R.drawable.a_56_al_waali,
                R.raw.a_56_al_waali
            )
        )
        list.add(
           Name(
                "৫৭ ",
                "আল-হা'মীদ",
                "সকল প্রশংসার অধিকারী",
                "যে ব্যক্তি ৪৫ দিন পর্যন্ত ধারাবাহিক ৯৩ বার নির্জনতায় নামটি পাঠ করবে, ইনশাআল্লাহ্‌ সকল অসৎ স্বভাব দূর হয়ে যাবে এবং তার থেকে উত্তম কার্যাবলী প্রকাশ পাবে।",
                R.drawable.a_57_al_hamid,
                R.raw.a_57_al_hamid
            )
        )
        list.add(
           Name(
                "৫৮ ",
                "আল-মুহছী",
                "সকল সৃষ্টির ব্যপারে অবগত",
                "যে ব্যক্তি রুটির ২০ টি টুকরোর উপর প্রতিদিন ২০ বার এই নামটি পড়ে ফু দিবে এবং খাবে তাহলে ইনশাআল্লাহ্‌ সৃষ্টি জগত তার অনুগত হয়ে যাবে।",
                R.drawable.a_58_al_muhsi,
                R.raw.a_58_al_muhsi
            )
        )
        list.add(
           Name(
                "৫৯ ",
                "আল-মুব্দি'",
                "প্রথমবার-সৃষ্টিকর্তা",
                "যে ব্যক্তি সেহরীর সময় গর্ভবতি নারীর পেটের উপর হাত রেখে ৯৯ বার এই নামটি পাঠ করবে, ইনশাআল্লাহ্‌ না তার গর্ভপাত হবে, না সময়ের আগে বাচ্চা ভূমিষ্ঠ হবে।",
                R.drawable.a_59_al_mubdi,
                R.raw.a_59_al_mubdi
            )
        )
        list.add(
           Name(
                "৬০ ",
                "আল-মুঈ'দ",
                "পুনরায়-সৃষ্টিকর্তা",
                "কোন ব্যক্তি হারিয়ে গেলে যখন গৃহের সকল ব্যক্তি ঘুমিয়ে পড়বে তখন হারানো ব্যক্তিকে ফেরত আনার জন্য গৃহের ৪ কোণে ৭০ বার নামটি পড়বে, ইনশাআল্লাহ্‌ হারানো ব্যক্তি ৭ দিনের মধ্যে ফেরত আসবে অথবা তার কোন খবর পাওয়া যাবে।",
                R.drawable.a_60_al_mueed,
                R.raw.a_60_al_mueed
            )
        )
        list.add(
           Name(
                "৬১ ",
                "আল-মুহ'য়ী",
                "জীবন-দানকারী",
                "যে ব্যক্তি অসুস্থ হবে সে অধিক হারে পাঠ করবে অথবা কোন রোগীর উপর ফু দিবে তাহলে ইনশাআল্লাহ্‌ সুস্থ হয়ে যাবে।",
                R.drawable.a_61_al_muhi,
                R.raw.a_61_al_muhi
            )
        )
        list.add(
           Name(
                "৬২ ",
                "আল-মুমীত",
                "মৃত্যু-দানকারী",
                "যে ব্যক্তি আত্মার নিয়ন্ত্রনে না থাকে সে শয়ন কালে বক্ষদেশে হাত রেখে এই নামটি পড়তে পড়তে ঘুমিয়ে পড়বে। আল্লাহ্‌ চান তো তার নফস বাধ্য ও অনুগত হয়ে যাবে।",
                R.drawable.a_62_al_mumit,
                R.raw.a_62_al_mumit
            )
        )
        list.add(
           Name(
                "৬৩ ",
                "আল-হাইয়্যু",
                "চিরঞ্জীব",
                "যে ব্যক্তি প্রতিদিন ৩০০০ বার এই নামটি পাঠ করবে ইনশাআল্লাহ্‌ সে কখনও অসুস্থ হবেনা।",
                R.drawable.a_63_al_haiyou,
                R.raw.a_63_al_haiyou
            )
        )
        list.add(
           Name(
                "৬৪ ",
                "আল-ক্বাইয়্যুম",
                "সমস্তকিছুর ধারক ও সংরক্ষণকারী",
                "যে ব্যক্তি এই নামটি শেষ রাতে অধিকবার পড়বে, ইনশাআল্লাহ্‌ মানুষের হৃদয়ে তার মর্যাদা বৃদ্ধি পাবে।",
                R.drawable.a_64_al_kaiyoum,
                R.raw.a_64_al_kaiyoum
            )
        )
        list.add(
           Name(
                "৬৫ ",
                "আল-ওয়াজিদ",
                "অফুরন্ত ভান্ডারের অধিকারী",
                "খাওয়ার সময় পড়লে ওই খাদ্য কলবের শক্তি ও নূর সৃষ্টির সহায়ক হবে।",
                R.drawable.a_65_al_wazid,
                R.raw.a_65_al_wazid
            )
        )
        list.add(
           Name(
                "৬৬ ",
                "আল-মাজিদ",
                "শ্রেষ্ঠত্বের অধিকারী",
                "যে ব্যক্তি নির্জনতায় এই নামটি অধিক পাঠ করলে, ইনশাআল্লাহ্‌ তার অন্তরের ভিতর আল্লাহ্‌ এর জ্যোতি প্রকাশ হতে শুরু করবে।",
                R.drawable.a_66_al_mazid,
                R.raw.a_66_al_mazid
            )
        )
        list.add(
           Name(
                "৬৭ ",
                "আল-ওয়াহি'দ",
                "এক ও অদ্বিতীয়",
                "প্রত্যহ ১০০০ বার পাঠ করলে মন থেকে ভয় ভীতি দূর হয়ে যাবে।",
                R.drawable.a_67_al_wahid,
                R.raw.a_67_al_wahid
            )
        )
        list.add(
           Name(
                "৬৮ ",
                "আছ্-ছমাদ",
                "অমুখাপেক্ষী",
                "যে ব্যক্তি ভোর রাতে অথবা কিছু রাত থাকতে সেজদায় মাথা রেখে ১১৫ অথবা ১২৫ বার এই নামটি পড়বে, তার বাহ্যিক ও ভিতরগত ভাবে সত্যবাদিতা লাভ হবে এবং কোন অত্যাচারি দ্বারা পিষ্ট হবেনা।",
                R.drawable.a_68_as_samad,
                R.raw.a_68_as_samad
            )
        )
        list.add(
           Name(
                "৬৯ ",
                "আল-ক্বদির",
                "সর্বশক্তিমান",
                "যে ব্যক্তি ওজু করার সময় অঙ্গ প্রত্যঙ্গ ধৌত করার সময় প্রতিটি জোড়ার উপর এই নামটি পড়বে, সে কখন জালিমের থাবায় আবদ্ধ হবেনা। কোন শত্রু তার উপর বিজয় লাভ করতে পারবেনা।",
                R.drawable.a_69_al_qaadir,
                R.raw.a_69_al_qaadir
            )
        )
        list.add(
           Name(
                "৭০ ",
                "আল-মুক্ব্তাদির",
                "নিরঙ্কুশ-সিদ্বান্তের-অধিকারী",
                "যদি কেউ এই নামটি সর্বদা পড়ে তবে তার উদাসীনতা স্মরনের দ্বারা পরিবর্তিত হবে। যে ব্যক্তি নিদ্রা থেকে উঠার পর ২০ বার এই নামটি পড়বে, তবে তার সব কাজ ঠিক এবং সমাধান হয়ে যাবে।",
                R.drawable.a_70_al_muktadir,
                R.raw.a_70_al_muktadir
            )
        )
        list.add(
           Name(
                "৭১ ",
                "আল-মুক্বদ্দিম",
                "অগ্রসারক",
                "যে ব্যক্তি যুদ্ধের সময় অধিক হারে পরবে অথবা লিখে নিজের কাছে রাখবে, আল্লাহ্‌ তায়ালা তাকে সামনে অগ্রসর হওয়ার ক্ষমতা দান করবেন এবং শত্রুদের থেকে নিরাপদ রাখবেন।",
                R.drawable.a_71_al_mu_koddim,
                R.raw.a_71_al_mu_koddim
            )
        )
        list.add(
           Name(
                "৭২ ",
                "আল-মুয়াক্খির",
                "অবকাশ দানকারী",
                "প্রতিদিন ১০০ বার আল্লাহ্‌ এর নাম পাঠ করলে, তিনি দুর্মূল্য এবং আল্লাহর প্রিয় হয়ে যাবেন। ইনশাআল্লাহ্‌",
                R.drawable.a_72_al_muakhir,
                R.raw.a_72_al_muakhir
            )
        )
        list.add(
           Name(
                "৭৩ ",
                "আল-আউয়াল",
                "সর্বপ্রথম",
                "কোন ব্যক্তি পুত্র সন্তান এর ইচ্ছা  পোষণ করলে, ৪০ দিনের জন্য ৪০ বার নামটি পাঠ করলে ইনশাআল্লাহ্‌ তার উদ্দেশ্য পুরন হবে।",
                R.drawable.a_73_al_auwal,
                R.raw.a_73_al_auwal
            )
        )
        list.add(
           Name(
                "৭৪ ",
                "আল-আখির",
                "অনন্ত, সর্বশেষ",
                "যে ব্যক্তি প্রতিদিন ১০০০ বার পরবে, তার অন্তর থেকে আল্লাহ্‌ ছাড়া অন্য কিছুর ভালবাসা দূর হয়ে যাবে।",
                R.drawable.a_74_al_akhir,
                R.raw.a_74_al_akhir
            )
        )
        list.add(
           Name(
                "৭৫ ",
                "আজ-জ'হির",
                "সম্পূর্নরূপে-প্রকাশিত",
                "প্রত্যহ ইশরাক এর পর ৫০০ বার পড়লে চোখের দৃষ্টি শক্তি ও অন্তরে নূর লাভ হয়।",
                R.drawable.a_75_azjohir,
                R.raw.a_75_azjohir
            )
        )
        list.add(
           Name(
                "৭৬ ",
                "আল-বাত্বিন",
                "দৃষ্টি হতে অদৃশ্য",
                "প্রত্যহ ৩৩ বার পড়লে গোপন রহস্য জানা যাবে। তার অন্তরে আল্লাহ্‌র ভালবাসা সৃষ্টি হবে।",
                R.drawable.a_76_al_batin,
                R.raw.a_76_al_batin
            )
        )
        list.add(
           Name(
                "৭৭ ",
                "আল-ওয়ালি",
                "সমস্ত-কিছুর-অনিভাব্ক",
                "এ নামের নিয়মিত যিকির করলে আল্লাহ বিপদ আপদ থেকে রক্ষা করে।",
                R.drawable.a_77_al_wali,
                R.raw.a_77_al_wali
            )
        )
        list.add(
           Name(
                "৭৮ ",
                "আল-মুতাআ'লি",
                "সৃষ্টির গুনাবলীর উর্দ্ধে",
                "যে ব্যক্তি অধিক বার পরবে, ইনশাআল্লাহ্‌ তার সমস্যা দূর হবে।",
                R.drawable.a_78_al_muta_ali,
                R.raw.a_78_al_muta_ali
            )
        )
        list.add(
           Name(
                "৭৯ ",
                "আল-বার্",
                "পরম-উপকারী, অণুগ্রহশীল",
                "কোন ব্যক্তি ৭ বার আল্লাহ্‌র এই নাম পাঠ করে সন্তান জন্মের পর তার সন্তানের উপর ফুঁ দিলে, আল্লাহ্‌ বিপর্যয় থেকে তার সন্তান কে সুরক্ষা করবে। ইনশাআল্লাহ্",
                R.drawable.a_79_al_barr,
                R.raw.a_79_al_barr
            )
        )
        list.add(
           Name(
                "৮০ ",
                "আত্-তাওয়াব",
                "তাওবার তাওফিক দানকারী এবং কবুলকারী",
                "চাশতের নামাযের পর সেজদায় গিয়ে এ নামটি ৩০০ বার পড়বে, ইনশাআল্লাহ্‌ তার সত্য তওবা লাভ হবে। যে ব্যাক্তি এ নামটি বার বার পাঠ করবে, তার সকল কর্ম সহজ হবে। যদি কোন অত্যাচারীর উপর ফুঁ দেয়া হয় তবে ইনশাআল্লাহ্‌ তা থেকে মুক্তি লাভ হবে।",
                R.drawable.a_80_attaowad,
                R.raw.a_80_attaowad
            )
        )
        list.add(
           Name(
                "৮১ ",
                "আল-মুনতাক্বিম",
                "প্রতিশোধ-গ্রহণকারী",
                "যে ব্যক্তি ন্যায়ের উপর থাকে এবং শত্রু থেকে প্রতিশোধ নেয়ার ক্ষমতা না থাকে, সে তিন জুম্মা পর্যন্ত অধিকহারে (ইয়া মুনতাক্বিমু) পড়বে, আল্লাহ তায়ালা স্বয়ং তার থেকে প্রতিশোধ নিয়ে নিবেন।",
                R.drawable.a_81_al_muntakim,
                R.raw.a_81_al_muntakim
            )
        )
        list.add(
           Name(
                "৮২ ",
                "আল-আ'ফঊ",
                "পরম-উদার",
                "যার প্রচুর গুনাহ আছে, সে লোকটি প্রতিনিয়ত এ নামটি পড়লে আল্লাহ তায়ালা তার গুনাহ ক্ষমা করে দিবেন।",
                R.drawable.a_82_al_afu,
                R.raw.a_82_al_afu
            )
        )
        list.add(
           Name(
                "৮৩ ",
                "আর-রউফ",
                "পরম-স্নেহশীল",
                "যে ব্যক্তি দশবার দুরুদ শরীফ এবং দশবার এ নামটি পড়বে, তবে ইনশালাআল্লাহ তার ক্রোধ দূর হয়ে যাবে। অন্য রাগান্বিত  ব্যাক্তির উপর ফুঁ দিলে তবে তার রাগ দূর হবে।",
                R.drawable.a_83_al_ra_oof,
                R.raw.a_83_al_ra_oof
            )
        )
        list.add(
           Name(
                "৮৪ ",
                "মালিকুল-মুলক",
                "সমগ্র জগতের বাদশাহ্",
                "যে ব্যক্তি (ইয়া মালিকাল মুলক) সর্বদা পাঠ করবে, আল্লাহ তায়ালা তাকে লোকদের থেকে অমুখাপেক্ষী করে দিবেন। সে কার মুখাপেক্ষী থাকবে না",
                R.drawable.a_84_malikul_mulk,
                R.raw.a_84_malikul_mulk
            )
        )
        list.add(
           Name(
                "৮৫ ",
                "যুল-জালালি-ওয়াল-ইকরাম",
                "মহিমান্বিত ও দয়াবান সত্তা",
                "যে ব্যক্তি অধিকহারে পড়বে, আল্লাহ তায়ালা তাকে শ্রেষ্ঠত্ব ও সম্মান এবং সৃষ্টজগত থেকে অমুখাপেক্ষীতা দান করবেন।",
                R.drawable.a_85_zul_jalali_wal_ikrom,
                R.raw.a_85_zul_jalali_wal_ikrom
            )
        )
        list.add(
           Name(
                "৮৬ ",
                "আল-মুক্ব্সিত",
                "হকদারের হক-আদায়কারী",
                "যে ব্যাক্তি এ নামটি প্রতিদিন ১০০ বার পড়বে, শয়তানের আনিদিষ্টতা ও কুমন্ত্রণা থেকে নিরাপদ থাকবে। যদি ৭ বার পড়ে তবে সে উদ্দেশ্য অর্জন হবে।",
                R.drawable.a_86_al_muksit,
                R.raw.a_86_al_muksit
            )
        )
        list.add(
           Name(
                "৮৭ ",
                "আল-জামিই'",
                "একত্রকারী, সমবেতকারী",
                "যার আত্মীয়-স্বজন ও বন্ধু বান্ধব বিক্ষিপ্ত হয়ে থাকে, সে চাশতের সময় গোসল করে আকাশের দিকে তাকিয়ে আল্লাহ্‌র এই নাম ১০০ বার পাঠ করলে তার পরিবারের হারানো সদস্য শিগ্রই খুঁজে পাবেন। ইনশাআল্লাহ্‌",
                R.drawable.a_87_al_jami,
                R.raw.a_87_al_jami
            )
        )
        list.add(
           Name(
                "৮৮ ",
                "আল-গণিই",
                "অমুখাপেক্ষী ধনী",
                "যে ব্যাক্তি প্রতিদিন ৭০ বার এই নামটি পড়বে, আল্লাহ তাআলা তার অর্থ-সম্পদ বরকত দান করবেন। ইনশাল্লাল্লাহ সে কারো মুখাপেক্ষী হবে না।",
                R.drawable.a_88_al_goni,
                R.raw.a_88_al_goni
            )
        )
        list.add(
           Name(
                "৮৯ ",
                "আল-মুগণিই",
                "পরম-অভাবমোচনকারী",
                "যে ব্যাক্তি শুরু ও শেষে ১১ বার দুরুদ শরীফ পড়ে এগার শত এগার বার ওযীফার ন্যায় এ নামটি পড়বে, তবে আল্লাহ তায়ালা তাকে বাহিরগত ও ভিতরগত ধনী করে দিবেন।",
                R.drawable.a_89_al_mugni,
                R.raw.a_89_al_mugni
            )
        )
        list.add(
           Name(
                "৯০ ",
                "আল-মানিই",
                "অকল্যানরোধক",
                "যদি স্ত্রির সাথে ঝগড়া-বিবাদ অথবা তিক্ততা সৃষ্টি হয়ে থাকে, তবে বিছানায় শোয়ার সময় ২০ বার এ নামটি পড়বে, ইনশাল্লাহ ঝগড়া-বিবাদ ও তিক্ততা দূর হয়ে যাবে এবং পরস্পর ভালবাসা সৃষ্টি হয়ে যাবে।",
                R.drawable.a_90_al_mani,
                R.raw.a_90_al_mani
            )
        )
        list.add(
           Name(
                "৯১ ",
                "আয্-যর",
                "ক্ষতিসাধনকারী",
                "সকাল সন্ধা এ নামের ‍যিকির করলে সকল ভাল কাজে সফলতা আসবে ইনশাআল্লাহ।",
                R.drawable.a_91_addhor,
                R.raw.a_91_addhor
            )
        )
        list.add(
           Name(
                "৯২ ",
                "আন্-নাফিই'",
                "কল্যাণকারী",
                "যে ব্যক্তি কোন পরিচিত স্থানে পোঁছাবে এবং শুক্রবার রাতে যে ব্যক্তি নৌকা অথবা অন্য কোন যানবাহনে আরোহণের পর অধিকহারে পড়তে থাকবে,  ইনশাআল্লাহ্‌ ইচ্ছানুযায়ী কাজ হবে।",
                R.drawable.a_92_an_nafi,
                R.raw.a_92_an_nafi
            )
        )
        list.add(
           Name(
                "৯৩ ",
                "আন্-নূর",
                "পরম-আলো",
                "যে ব্যক্তি জুমার রাতে সাত বার সুরা নুর এবং এক হাজার বার এ নামটি পড়বে, তবে ইনশাআল্লাহ্‌ তার অন্তর আল্লাহর জ্যোতি দারা আলকিত হয়ে যাবে।",
                R.drawable.a_93_an_nur,
                R.raw.a_93_an_nur
            )
        )
        list.add(
           Name(
                "৯৪ ",
                "আল-হাদী",
                "পথ-প্রদর্শক",
                "যে ব্যক্তি হাত উঠিয়ে আকাশ পানে মূখ করে এ নামটি অধিক হারে পড়বে,  অবশেষে মুখমন্ডলে হাত মুছে নিবে, ইনশাআল্লাহ্‌ তার পূর্ণ হেদায়েত লাভ হবে,  আর মারেফাত পন্থীদের মধ্যে অন্তভুক্ত হয়ে যাবে।",
                R.drawable.a_94_al_hadi,
                R.raw.a_94_al_hadi
            )
        )
        list.add(
           Name(
                "৯৫ ",
                "আল-বাদীই",
                "অতুলনীয়",
                "যে ব্যক্তি কোন দুশ্চিন্তা বিপদাপদ অথবা কোন সমস্যা সম্মুখে আসে,  সে ১০০০ বার এ নামটি পড়বে ইনশাআল্লাহ্‌ সমস্যার সমাধান লাভ হবে।",
                R.drawable.a_95_al_badi_i,
                R.raw.a_95_al_badi_i
            )
        )
        list.add(
           Name(
                "৯৬ ",
                "আল-বাক্বী",
                "চিরস্থায়ী, অবিনশ্বর",
                "জুম্মার রাতে যে ব্যক্তি এ নামটি ১০০ বার পড়বে, আল্লাহ তায়ালা তাকে সব ধরনের অনিষ্ট ও ক্ষতি থেকে নিরাপরাদ রাখবেন।",
                R.drawable.a_96_al_baki,
                R.raw.a_96_al_baki
            )
        )
        list.add(
           Name(
                "৯৭ ",
                "আল-ওয়ারিস'",
                "উত্তরাধিকারী",
                "যে ব্যক্তি প্রত্যহ সূর্যোদয়ের পূর্বক্ষণে ১০১ বার পড়বে, ইনশাআল্লাহ্‌ সে যাবতীয় দুঃখ- বেদনা, চিন্তা- ভাবনা, কঠোরতা ও বিপদ থেকে মুক্তি থাকবে।",
                R.drawable.a_97_al_waris,
                R.raw.a_97_al_waris
            )
        )
        list.add(
           Name(
                "৯৮ ",
                "আর-রাশীদ",
                "সঠিক পথ-প্রদর্শক",
                "যে ব্যক্তি নিজের কোন কাজ বা উদ্দেশ্য সমাধানের কোন তদবির বুঝে না আসে, মাগরিব ও এশার মাঝে সে (আর-রাশীদু) নামটি ১০০০ বার পড়বে, তবে ইনশাআল্লাহ্‌ স্বপ্নে তদ্বির দেখা যাবে, অথবা অন্তরে ঢেলে দেয়া হবে।",
                R.drawable.a_98_ar_rashid,
                R.raw.a_98_ar_rashid
            )
        )
        list.add(
           Name(
                "৯৯ ",
                "আস-সবুর",
                "অত্যধিক ধৈর্যধারণকারী",
                "যে ব্যক্তি সূর্যোদয়ের পূর্বে এ নামটি একশত বার পড়বে, ইনশাআল্লাহ্‌ সেদিন সে সকল বিপদাপদ থেকে নিরাপদ থাকবে ও বরকত লাভ হয়। শত্রু ও হিংসুকদের মুখ বন্ধ থাকবে।",
                R.drawable.a_99_as_sobur,
                R.raw.a_99_as_sobur
            )
        )


        CoroutineScope(Dispatchers.IO).launch{
            suraDao.delete()
        suraDao.update(list)
        }





        val locale = Locale("bn")
        Locale.setDefault(locale)
        val config = resources.configuration
        config.setLocale(locale)



        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.N)
            createConfigurationContext(config)
        resources.updateConfiguration(config, resources.displayMetrics)
        setContent {
            NamajShikkhaTheme (darkTheme = false,dynamicColor = false){
                Locale.setDefault(Locale("bn"))
                // A surface container using the 'background' color from the theme
                Surface(
                    modifier = Modifier.fillMaxSize(),
                    color = MaterialTheme.colorScheme.background
                ) {
                    RequireLatestVersion {
                        MainContent()
                    }
                }
            }
        }
    }
}

private fun copyAssets(context: Context) {
    val assetManager: AssetManager = context.assets
    var files: Array<String>? = null
    try {
        files = assetManager.list("")
    } catch (e: IOException) {
        Log.e("tag", "Failed to get asset file list.", e)
    }
    if (files != null) for (filename in files) {
        var `in`: InputStream? = null
        var out: OutputStream? = null
        try {
            `in` = assetManager.open(filename)
            val outFile = if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.N) {
                File(context.dataDir, filename)
            } else {
                File(context.cacheDir, filename)

            }
            out = FileOutputStream(outFile)
            copyFile(`in`, out)
        } catch (e: IOException) {
            Log.e("123321", "Failed to copy asset file: $filename", e)
        } finally {
            if (`in` != null) {
                try {
                    `in`.close()
                } catch (e: IOException) {
                    // NOOP
                }
            }
            if (out != null) {
                try {
                    out.close()
                } catch (e: IOException) {
                    // NOOP
                }
            }
        }
    }
}

@Throws(IOException::class)
private fun copyFile(`in`: InputStream, out: OutputStream) {
    val buffer = ByteArray(1024)
    var read: Int
    while (`in`.read(buffer).also { read = it } != -1) {
        out.write(buffer, 0, read)
    }
}

@Composable
fun MainContent(
    appState: AppState = rememberAppState(),

    ) {
    AppNavHost(
        navController = appState.navController,
        onBackClick = appState::onBackClick
    )
}


